modifications in readme
